tap "homebrew/bundle"
tap "homebrew/services"
tap "localsend/localsend"
tap "ngrok/ngrok"
brew "php"
brew "composer"
brew "git-lfs"
brew "mysql-client@8.4"
brew "node"
brew "spotify_player"
brew "vim"
cask "amethyst"
cask "chatgpt"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono"
cask "hyper"
cask "keeweb"
cask "localsend"
cask "ngrok"
cask "obsidian"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "readdle-spark"
cask "signal"
cask "spotify"
cask "syncthing"
cask "teamviewer"
cask "visual-studio-code"
cask "whatsapp"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "nguyenhoanglam.beautiful-dracula"
