tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "localsend/localsend"
# Console Matrix
brew "cmatrix"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@16"
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Terminal-based client for Spotify
brew "spotify-tui"
# Vi 'workalike' with many additional features
brew "vim"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Manage team projects and tasks
cask "asana"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal built on web technologies
cask "hyper"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Password manager compatible with KeePass
cask "keeweb"
# An open source cross-platform alternative to AirDrop
cask "localsend"
# Software for Logitech devices
cask "logitech-options"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PHP IDE by JetBrains
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# React client for Simplenote
cask "simplenote"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Real time file synchronisation software
cask "syncthing"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.vscode-mysql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nespinozacr.mysql-autocomplete"
